sha3raair/app/controllers/api/passenger/flights_controller.rb

SELECT "flights".* FROM "flights"
---
			def index
				flight = Flight.all

SELECT "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
			def show
				flight = Flight.find_by(id: id)