sha3raair/app/controllers/api/passenger/seats_controller.rb

SELECT "seats".* FROM "seats"
---
			def index
				seat = Seat.all

SELECT "seats".* FROM "seats" WHERE "seats"."pnr" = $1 LIMIT $2  [["pnr", "F1234"], ["LIMIT", 1]]
UPDATE "seats" SET "price" = $1, "updated_at" = $2 WHERE "seats"."id" = $3  [["price", 120], ["updated_at", "2021-03-09 09:02:41.326758"], ["id", 1]]
---
			def update
				seat = Seat.find_by(pnr: params[:pnr])

				if seat.update(seats_params)