sha3raair/app/controllers/api/adminstrator/admins_controller.rb

			def index
				admin = Admin.all
---
SELECT "admins".* FROM "admins"