sha3raair/app/controllers/api/adminstrator/flights_controller.rb

			def create
				flight = Flight.new(flight_params)

				if flight.save
---
INSERT INTO "flights" ("destination", "departure", "plane_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["destination", "paris"], ["departure", "Cairo"], ["plane_id", 2], ["created_at", "2021-03-09 20:34:40.133264"], ["updated_at", "2021-03-09 20:34:40.133264"]]