sha3raair/app/controllers/api/adminstrator/planes_controller.rb

			def index
				plane = Plane.all
---
SELECT "planes".* FROM "planes"

			def show
				plane = Plane.find_by(planeType: params[:planeType])
---
SELECT "planes".* FROM "planes" WHERE "planes"."planeType" = $1 LIMIT $2  [["planeType", "B780"], ["LIMIT", 1]]

			def create
				plane = Plane.new(plane_params)

				if plane.save
---
INSERT INTO "planes" ("planeType", "seatConfig", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["planeType", "B780"], ["seatConfig", "{3,5,120,4,10,100,10,10,40}"], ["created_at", "2021-03-09 08:04:46.902871"], ["updated_at", "2021-03-09 08:04:46.902871"]]

			def destroy
				plane = Plane.find_by(planeType: params[:planeType])

				if plane.destroy
---
SELECT "planes".* FROM "planes" WHERE "planes"."planeType" = $1 LIMIT $2  [["planeType", "B777"], ["LIMIT", 1]]
DELETE FROM "planes" WHERE "planes"."id" = $1  [["id", 3]]