sha3raair/app/controllers/api/adminstrator/planes_controller.rb

			def show
				plane = Plane.find(params[:id])
---
SELECT "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]